wavenumber-eng/avc/src/avc/avc_core0/board/pin_mux.c
    gpio_pin_config_t CENTER_BTN_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_17 (pin K15)  */
    GPIO_PinInit(BOARD_BTNPINS_CENTER_BTN_GPIO, BOARD_BTNPINS_CENTER_BTN_PIN, &CENTER_BTN_config);

    gpio_pin_config_t RIGHT_BTN_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_19 (pin K17)  */
    GPIO_PinInit(BOARD_BTNPINS_RIGHT_BTN_GPIO, BOARD_BTNPINS_RIGHT_BTN_PIN, &RIGHT_BTN_config);

    gpio_pin_config_t LEFT_BTN_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO3_21 (pin L16)  */
    GPIO_PinInit(BOARD_BTNPINS_LEFT_BTN_GPIO, BOARD_BTNPINS_LEFT_BTN_PIN, &LEFT_BTN_config);

    /* PORT3_17 (pin K15) is configured as PIO3_17 */
    PORT_SetPinMux(BOARD_BTNPINS_CENTER_BTN_PORT, BOARD_BTNPINS_CENTER_BTN_PIN, kPORT_MuxAlt0);

    PORT3->PCR[17] = ((PORT3->PCR[17] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_19 (pin K17) is configured as PIO3_19 */
    PORT_SetPinMux(BOARD_BTNPINS_RIGHT_BTN_PORT, BOARD_BTNPINS_RIGHT_BTN_PIN, kPORT_MuxAlt0);

    PORT3->PCR[19] = ((PORT3->PCR[19] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));

    /* PORT3_21 (pin L16) is configured as PIO3_21 */
    PORT_SetPinMux(BOARD_BTNPINS_LEFT_BTN_PORT, BOARD_BTNPINS_LEFT_BTN_PIN, kPORT_MuxAlt0);

    PORT3->PCR[21] = ((PORT3->PCR[21] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_IBE_MASK)))

                      /* Input Buffer Enable: Enables. */
                      | PORT_PCR_IBE(PCR_IBE_ibe1));
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
